# Web Scraping Project for Top 100 US Companies by Revenue

In [1]:
from bs4 import BeautifulSoup as bsp
import requests as req
import pandas as pd

In [2]:
url='https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

In [3]:
page=req.get(url)

In [4]:
soup=bsp(page.text,'html')

## Public Companies

In [5]:
table1=soup.find_all('table')[1]

In [6]:
table_columns1=table1.find_all('th')

In [7]:
table_columns1_titles=[col.text.strip() for col in table_columns1]
print(table_columns1_titles)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [8]:
df=pd.DataFrame(columns=table_columns1_titles)
df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [9]:
table1_column_data=table1.find_all('tr')

In [10]:
for row in table1_column_data[1:]:
    row_data=row.find_all('td')
    individual_row_data=[data.text.strip() for data in row_data]
    
    length=len(df)
    df.loc[length]=individual_row_data

In [11]:
df

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [12]:
df.to_csv(r'D:\Projects\Data Analysis\Portfolio Projects\Python\Web_Scraping\Top_US_Companies_By_Revenue\public.csv', 
          index=False)

## Private Companies

In [13]:
table2=soup.find_all('table')[2]

In [14]:
table_columns2=table2.find_all('th')

In [15]:
table_columns2_titles=[col.text.strip() for col in table_columns2]
print(table_columns2_titles)

['Rank', 'Name', 'Industry', 'Revenue (USD billions)', 'Employees', 'Headquarters']

In [16]:
df2=pd.DataFrame(columns=table_columns2_titles)
df2

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD billions), Employees, Headquarters]
Index: []

In [17]:
table2_column_data=table2.find_all('tr')

In [18]:
for row in table2_column_data[1:]:
    row_data=row.find_all('td')
    individual_row_data=[data.text.strip() for data in row_data]
    
    length=len(df2)
    df2.loc[length]=individual_row_data

In [19]:
df2

,Rank,Name,Industry,Revenue (USD billions),Employees,Headquarters
0,1,Cargill,Food industry,165,"155,000","Minnetonka, Minnesota"
1,2,Koch Industries,Conglomerate,125,"120,000","Wichita, Kansas"
2,3,Publix Super Markets,Retail,48,"230,000","Winter Haven, Florida"
3,4,"Mars, Incorporated",Food industry,45,"140,000","McLean, Virginia"
4,5,Pilot Corporation,Petroleum industry and Retail,41.9,"30,000","Knoxville, Tennessee"
5,6,H-E-B,Retail,38.9,"145,000","San Antonio, Texas"
6,7,Reyes Holdings,Wholesaling,35.3,"33,000","Rosemont, Illinois"
7,8,C&S Wholesale Grocers,Wholesaling,33,"14,000","Keene, New Hampshire"
8,9,Enterprise Holdings,Car rental,30,"80,000","Clayton, Missouri"
9,10,Love's,Petroleum industry and Retail,25.5,"38,000","Oklahoma City, Oklahoma"

In [20]:
df2.to_csv(r'D:\Projects\Data Analysis\Portfolio Projects\Python\Web_Scraping\Top_US_Companies_By_Revenue\private.csv', 
          index=False)